Revit 2027 API
PartsVisibility Enumeration
 Indicates the visibility of parts for the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PartsVisibility
Public Enumeration PartsVisibility
public enum class PartsVisibility
type PartsVisibility
Members
Member name | Value | Description
ShowOriginalOnly | 1 |  Show original elements, not parts, for the view.
ShowPartsAndOriginal | 2 |  Show both original elements and parts for the view.
ShowPartsOnly | 0 |  Show only parts for the view.
Unset | -1 |  Parts visibility is not set for the view.
See Also
Reference
Autodesk.Revit.DB Namespace